exemple.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/apps/scm/cmk/v2">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:B2BMessage>
         <v2:Header>
            <v2:ID type="String">OUT_1111</v2:ID>
            <v2:Sender>
               <v2:ID type="MISC">335092318</v2:ID>
            </v2:Sender>
            <v2:Intermediary>
               <v2:ID type="Generic">DOCAPOSTE</v2:ID>
            </v2:Intermediary>
            <v2:Recipient>
               <v2:ID type="MISC">642007991</v2:ID>
            </v2:Recipient>
            <v2:MessageDefinition>
               <v2:DocumentType>Invoice</v2:DocumentType>
               <v2:Protocol>UBL</v2:Protocol>
               <v2:Version>2.1</v2:Version>
            </v2:MessageDefinition>
         </v2:Header>
         <v2:Payload>

<ubl:Invoice xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:ns2="http://xmlns.oracle.com/apps/scm/cmk/v2" xmlns:ubl="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" >
   <cbc:UBLVersionID>2.1</cbc:UBLVersionID>
   <cbc:CustomizationID>urn:cen.eu:en16931:2017</cbc:CustomizationID>
      <cbc:ProfileID>S1</cbc:ProfileID>
   <cbc:ID>29102025004</cbc:ID>
   <cbc:IssueDate>2025-06-21</cbc:IssueDate>
   <cbc:DueDate>2025-09-30</cbc:DueDate>
   <cbc:InvoiceTypeCode name="INV">380</cbc:InvoiceTypeCode>
   <cbc:Note>#PMT# Indemnité forfaitaire pour frais de recouvrement de 40 €</cbc:Note>
   <cbc:Note>#PMD# Pénalités égales à 3 fois le taux de l’intérêt légal</cbc:Note>
   <cbc:DocumentCurrencyCode>EUR</cbc:DocumentCurrencyCode>
   <cac:OrderReference>
       <cbc:ID>GLC014584</cbc:ID>
   </cac:OrderReference>
   <cac:AccountingSupplierParty>
       <cac:Party>
            <cbc:EndpointID schemeID="0225">335092318</cbc:EndpointID>
           <cac:PartyName>
               <cbc:Name>ORACLE FRANCE</cbc:Name>
           </cac:PartyName>
           <cac:PostalAddress>
               <cbc:StreetName>15 BOULEVARD CHARLES DE GAULLE</cbc:StreetName>
               <cbc:CityName>COLOMBES CEDEX</cbc:CityName>
               <cbc:PostalZone>92715</cbc:PostalZone>
               <cac:AddressLine>
                   <cbc:Line>15 BOULEVARD CHARLES DE GAULLE</cbc:Line>
               </cac:AddressLine>
               <cac:Country>
                   <cbc:IdentificationCode>FR</cbc:IdentificationCode>
               </cac:Country>
           </cac:PostalAddress>
           <cac:PartyTaxScheme>
               <cbc:CompanyID>FR06335092318</cbc:CompanyID>
               <cac:TaxScheme>
                   <cbc:ID>VAT</cbc:ID>
               </cac:TaxScheme>
           </cac:PartyTaxScheme>
           <cac:PartyLegalEntity>
               <cbc:RegistrationName>ORACLE FRANCE</cbc:RegistrationName>
               <cbc:CompanyID schemeID="0002">335092318</cbc:CompanyID>
           </cac:PartyLegalEntity>
       </cac:Party>
   </cac:AccountingSupplierParty>
   <cac:AccountingCustomerParty>
       <cac:Party>
            <cbc:EndpointID schemeID="0225">642007991</cbc:EndpointID>
           <cac:PartyName>
               <cbc:Name>SC Galec</cbc:Name>
           </cac:PartyName>
           <cac:PostalAddress>
               <cbc:ID>642007991</cbc:ID>
               <cbc:StreetName>26 quai Marcel Boye</cbc:StreetName>
               <cbc:CityName>94200 IVRY-SUR-SEINE</cbc:CityName>
               <cbc:PostalZone>94200</cbc:PostalZone>
               <cac:AddressLine>
                   <cbc:Line>26 quai Marcel Boye</cbc:Line>
               </cac:AddressLine>
               <cac:Country>
                   <cbc:IdentificationCode>FR</cbc:IdentificationCode>
               </cac:Country>
           </cac:PostalAddress>
           <cac:PartyTaxScheme>
               <cbc:CompanyID>FR36642007991</cbc:CompanyID>
               <cac:TaxScheme>
                   <cbc:ID>VAT</cbc:ID>
               </cac:TaxScheme>
           </cac:PartyTaxScheme>
           <cac:PartyLegalEntity>
               <cbc:RegistrationName>SC Galec</cbc:RegistrationName>
               <cbc:CompanyID schemeID="0002">642007991</cbc:CompanyID>
           </cac:PartyLegalEntity>
       </cac:Party>
   </cac:AccountingCustomerParty>
   <cac:Delivery>
       <cac:DeliveryLocation>
           <cac:Address>
               <cbc:StreetName>26 quai Marcel Boyer</cbc:StreetName>
               <cbc:CityName>94200 IVRY-SUR-SEINE</cbc:CityName>
               <cbc:PostalZone>94200</cbc:PostalZone>
               <cac:AddressLine>
                   <cbc:Line>26 quai Marcel Boyer</cbc:Line>
               </cac:AddressLine>
               <cac:Country>
                   <cbc:IdentificationCode>FR</cbc:IdentificationCode>
               </cac:Country>
           </cac:Address>
       </cac:DeliveryLocation>
   </cac:Delivery>
   <cac:PaymentMeans>
       <cbc:PaymentMeansCode name="VIREMENT">30</cbc:PaymentMeansCode>
       <cac:PayeeFinancialAccount>
           <cbc:ID>FR761111111111111111</cbc:ID>
       </cac:PayeeFinancialAccount>
   </cac:PaymentMeans>
   <cac:PaymentTerms>
       <cbc:ID>30N</cbc:ID>
   </cac:PaymentTerms>
   <cac:TaxTotal>
       <cbc:TaxAmount currencyID="EUR">20</cbc:TaxAmount>
       <cac:TaxSubtotal>
           <cbc:TaxableAmount currencyID="EUR">100</cbc:TaxableAmount>
           <cbc:TaxAmount currencyID="EUR">20</cbc:TaxAmount>
           <cac:TaxCategory>
               <cbc:ID>S</cbc:ID>
               <cbc:Percent>20</cbc:Percent>
               <cac:TaxScheme>
                   <cbc:ID>VAT</cbc:ID>
               </cac:TaxScheme>
           </cac:TaxCategory>
       </cac:TaxSubtotal>
   </cac:TaxTotal>
   <cac:LegalMonetaryTotal>
       <cbc:LineExtensionAmount currencyID="EUR">100</cbc:LineExtensionAmount>
       <cbc:TaxExclusiveAmount currencyID="EUR">100</cbc:TaxExclusiveAmount>
       <cbc:TaxInclusiveAmount currencyID="EUR">120</cbc:TaxInclusiveAmount>
       <cbc:AllowanceTotalAmount currencyID="EUR">0</cbc:AllowanceTotalAmount>
       <cbc:ChargeTotalAmount currencyID="EUR">0</cbc:ChargeTotalAmount>
       <cbc:PrepaidAmount currencyID="EUR">0</cbc:PrepaidAmount>
       <cbc:PayableRoundingAmount currencyID="EUR">0</cbc:PayableRoundingAmount>
       <cbc:PayableAmount currencyID="EUR">120</cbc:PayableAmount>
   </cac:LegalMonetaryTotal>
   <cac:InvoiceLine>
       <cbc:ID>1</cbc:ID>
       <cbc:Note>Licence ERP</cbc:Note>
       <cbc:InvoicedQuantity unitCode="C62">1</cbc:InvoicedQuantity>
       <cbc:LineExtensionAmount currencyID="EUR">50</cbc:LineExtensionAmount>
       <cac:Item>
           <cbc:Name>Licence ERP</cbc:Name>
           <cac:ClassifiedTaxCategory>
               <cbc:ID>S</cbc:ID>
               <cbc:Percent>20</cbc:Percent>
               <cac:TaxScheme>
                   <cbc:ID>VAT</cbc:ID>
               </cac:TaxScheme>
           </cac:ClassifiedTaxCategory>
       </cac:Item>
       <cac:Price>
           <cbc:PriceAmount currencyID="EUR">50</cbc:PriceAmount>
       </cac:Price>
   </cac:InvoiceLine>
   <cac:InvoiceLine>
       <cbc:ID>2</cbc:ID>
       <cbc:Note>Licence ERP</cbc:Note>
       <cbc:InvoicedQuantity unitCode="C62">1</cbc:InvoicedQuantity>
       <cbc:LineExtensionAmount currencyID="EUR">50</cbc:LineExtensionAmount>
       <cac:Item>
           <cbc:Name>Licence ERP</cbc:Name>
           <cac:ClassifiedTaxCategory>
               <cbc:ID>S</cbc:ID>
               <cbc:Percent>20</cbc:Percent>
               <cac:TaxScheme>
                   <cbc:ID>VAT</cbc:ID>
               </cac:TaxScheme>
           </cac:ClassifiedTaxCategory>
       </cac:Item>
       <cac:Price>
           <cbc:PriceAmount currencyID="EUR">50</cbc:PriceAmount>
       </cac:Price>
   </cac:InvoiceLine>
</ubl:Invoice>




         </v2:Payload>
      </v2:B2BMessage>
   </soapenv:Body>
</soapenv:Envelope>	